# FlexDuctLengthOutOfLimits Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DuctFailures..::..FlexDuctLengthOutOfLimits Property
BuiltInFailures..::..DuctFailures Class See Also
---
The flex duct length of [Length Value] exceeds the maximum specified length of [Maximum Flex Duct Length Value]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FlexDuctLengthOutOfLimits { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FlexDuctLengthOutOfLimits As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FlexDuctLengthOutOfLimits {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DuctFailures Class
Autodesk.Revit.DB Namespace